# CurrentActiveView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewActivatedEventArgs..::..CurrentActiveView Property
ViewActivatedEventArgs Class See Also
---
The view that has just become active.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public View CurrentActiveView { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentActiveView As View
	Get
```

Visual C++
---
```text
public:
property View^ CurrentActiveView {
	View^ get ();
}
```

# See Also
ViewActivatedEventArgs Class
Autodesk.Revit.UI.Events Namespace